In [44]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

host = 'localhost'
port = '3306'
username = 'root'
password = ''
database = 'classicmodels'

engine = create_engine ('mysql+pymysql://'+username+':'+password+'@'+host+':'+port+'/'+database)

def run(sql) :
    df = pd.read_sql_query(sql, engine)
    return df

# Konversi CSV ke DataFrame

In [50]:
df_fromcsv = pd.read_csv('a_mahasiswa.csv')
df_fromcsv.to_sql(name = 'mahasiswa' , con = engine, 
                  if_exists = 'replace', index= False)
# if_exists = 'fail' / 'replace' / 'append'

In [51]:
df_results = run("SELECT * FROM mahasiswa")
print(df_results)

   ID   NAMA
0  11    ANI
1  22   BUDI
2  33  CITRA
3  44  DAMAR
4  55   ESTI

In [52]:
engine.execute("INSERT INTO mahasiswa VALUES(66, 'FAJAR')")

In [54]:
df_results = run("SELECT * FROM mahasiswa")
print(df_results)

   ID   NAMA
0  11    ANI
1  22   BUDI
2  33  CITRA
3  44  DAMAR
4  55   ESTI
5  66  FAJAR

In [56]:
#menambahkan data dengan variabel

id_mhs = '77'
nama_mhs = 'GILANG'
engine.execute("INSERT INTO mahasiswa VALUES("+id_mhs+", '"+nama_mhs+"')")

In [57]:
df_results = run("SELECT * FROM mahasiswa")
print(df_results)

   ID    NAMA
0  11     ANI
1  22    BUDI
2  33   CITRA
3  44   DAMAR
4  55    ESTI
5  66   FAJAR
6  77  GILANG

In [58]:
#ANI JADI ANDI
engine.execute("UPDATE mahasiswa SET NAMA = 'ANDI' WHERE ID = 11")

In [59]:
df_results = run("SELECT * FROM mahasiswa")
print(df_results)

   ID    NAMA
0  11    ANDI
1  22    BUDI
2  33   CITRA
3  44   DAMAR
4  55    ESTI
5  66   FAJAR
6  77  GILANG

## EXPORT DATAFRAME ke CSV

In [61]:
df_results.to_csv("dftocsv_mahasiswa.csv", index=False)